app/Controllers/Dashboard/Dosen.php

    private function getDosenStats($dosen_id)
    {
        $db = \Config\Database::connect();

        return [
            'total_kelas' => $db->table('tb_kelas')
                ->where('dosen_id', $dosen_id)
                ->countAllResults(),

            'total_mahasiswa' => $db->table('tb_kelas')
                ->select('DISTINCT tb_krs.mahasiswa_id')
                ->join('tb_krs', 'tb_krs.kelas_id = tb_kelas.id_kelas')
                ->where('tb_kelas.dosen_id', $dosen_id)
                ->where('tb_krs.status', 'Disetujui')
                ->countAllResults(false),

            'nilai_pending' => $db->table('tb_nilai')
                ->join('tb_kelas', 'tb_kelas.id_kelas = tb_nilai.kelas_id')
                ->where('tb_kelas.dosen_id', $dosen_id)
                ->where('tb_nilai.status', 'Draft')
                ->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `tb_kelas`
JOIN `tb_krs` ON `tb_krs`.`kelas_id` = `tb_kelas`.`id_kelas`
WHERE `tb_kelas`.`dosen_id` = '28'
AND `tb_krs`.`status` = 'Disetujui'
SELECT COUNT(*) AS `numrows`
FROM `tb_nilai`
JOIN `tb_kelas` ON `tb_kelas`.`id_kelas` = `tb_nilai`.`kelas_id`
WHERE `tb_kelas`.`dosen_id` = '28'
AND `tb_nilai`.`status` = 'Draft'

    private function getJadwalHariIni($dosen_id)
    {
        $db = \Config\Database::connect();
        $today = date('l');

        if (!$db->tableExists('tb_jadwal_kuliah')) {
            return $this->getKelasDosen($dosen_id);
        }

        return $db->table('tb_jadwal_kuliah')
            ->join('tb_mata_kuliah', 'tb_mata_kuliah.id_matkul = tb_jadwal_kuliah.mata_kuliah')
            ->join('tb_ruangan', 'tb_ruangan.id_ruangan = tb_jadwal_kuliah.ruangan_id')
            ->select('tb_jadwal_kuliah.*, tb_mata_kuliah.nama_matkul, tb_ruangan.nama_ruangan, tb_jadwal_kuliah.jam_mulai, tb_jadwal_kuliah.jam_selesai')
            ->where('tb_jadwal_kuliah.dosen', $dosen_id)
            ->where('tb_jadwal_kuliah.hari', $today)
            ->orderBy('tb_jadwal_kuliah.jam_mulai', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_jadwal_kuliah`.*, `tb_mata_kuliah`.`nama_matkul`, `tb_ruangan`.`nama_ruangan`, `tb_jadwal_kuliah`.`jam_mulai`, `tb_jadwal_kuliah`.`jam_selesai`
FROM `tb_jadwal_kuliah`
JOIN `tb_mata_kuliah` ON `tb_mata_kuliah`.`id_matkul` = `tb_jadwal_kuliah`.`mata_kuliah`
JOIN `tb_ruangan` ON `tb_ruangan`.`id_ruangan` = `tb_jadwal_kuliah`.`ruangan_id`
WHERE `tb_jadwal_kuliah`.`dosen` = '28'
AND `tb_jadwal_kuliah`.`hari` = 'Sunday'
ORDER BY `tb_jadwal_kuliah`.`jam_mulai` ASC

    private function getReminders($dosen_id)
    {
        $db = \Config\Database::connect();
        $reminders = [];

        // Check for nilai pending
        $nilai_pending = $db->table('tb_nilai')
            ->join('tb_kelas', 'tb_kelas.id_kelas = tb_nilai.kelas_id')
            ->where('tb_kelas.dosen_id', $dosen_id)
            ->where('tb_nilai.status', 'Draft')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_nilai`
JOIN `tb_kelas` ON `tb_kelas`.`id_kelas` = `tb_nilai`.`kelas_id`
WHERE `tb_kelas`.`dosen_id` = '28'
AND `tb_nilai`.`status` = 'Draft'