app/Controllers/Dashboard/Dosen.php

SELECT COUNT(*) AS `numrows`
FROM `tb_kelas`
WHERE `dosen_id` = '9'
SELECT COUNT(*) AS `numrows`
FROM `tb_kelas`
JOIN `tb_krs` ON `tb_krs`.`kelas_id` = `tb_kelas`.`id_kelas`
WHERE `tb_kelas`.`dosen_id` = '9'
AND `tb_krs`.`status` = 'Disetujui'
SELECT COUNT(*) AS `numrows`
FROM `tb_mahasiswa`
WHERE `dosen_pa_id` = '9'
SELECT COUNT(*) AS `numrows`
FROM `tb_nilai`
JOIN `tb_kelas` ON `tb_kelas`.`id_kelas` = `tb_nilai`.`kelas_id`
WHERE `tb_kelas`.`dosen_id` = '9'
AND `tb_nilai`.`status` = 'Draft'
---
    private function getDosenStats($dosen_id)
    {
        $db = \Config\Database::connect();

        $total_kelas = $db->table('tb_kelas')
            ->where('dosen_id', $dosen_id)
            ->countAllResults();

        $total_mahasiswa = $db->table('tb_kelas')
            ->join('tb_krs', 'tb_krs.kelas_id = tb_kelas.id_kelas')
            ->where('tb_kelas.dosen_id', $dosen_id)
            ->where('tb_krs.status', 'Disetujui')
            ->countAllResults();

        $mahasiswa_bimbingan = $db->table('tb_mahasiswa')
            ->where('dosen_pa_id', $dosen_id)
            ->countAllResults();

        $nilai_pending = $db->table('tb_nilai')
            ->join('tb_kelas', 'tb_kelas.id_kelas = tb_nilai.kelas_id')
            ->where('tb_kelas.dosen_id', $dosen_id)
            ->where('tb_nilai.status', 'Draft')
            ->countAllResults();