app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `tb_mahasiswa`
WHERE `status` = 'Aktif'
SELECT COUNT(*) AS `numrows`
FROM `tb_dosen`
WHERE `status` = 'Aktif'
SELECT COUNT(*) AS `numrows`
FROM `tb_prodi`
SELECT COUNT(*) AS `numrows`
FROM `tb_mata_kuliah`
SELECT *
FROM `tb_periode_akademik`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `tb_krs`
WHERE `status` = 'Menunggu Persetujuan'
SELECT COUNT(*) AS `numrows`
FROM `tb_krs`
WHERE `status` = 'Disetujui'
SELECT COUNT(*) AS `numrows`
FROM `tb_krs`
WHERE `status` = 'Ditolak'
SELECT COUNT(*) AS `numrows`
FROM `tb_kelas`
WHERE `periode_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `tb_beasiswa`
WHERE `status` = 'Aktif'
SELECT COUNT(*) AS `numrows`
FROM `tb_inventaris`
WHERE `status` = 'Baik'
SELECT COUNT(*) AS `numrows`
FROM `tb_pengaduan`
WHERE `status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `tb_artikel`
WHERE `status` = 'Published'
SELECT COUNT(*) AS `numrows`
FROM `tb_kegiatan`
WHERE `status` = 'Aktif'
SELECT SUM(`dana_masuk`) AS `dana_masuk`
FROM `tb_keuangan_internal`
WHERE DATE(tgl) = '2025-07-31'
SELECT SUM(`dana_keluar`) AS `dana_keluar`
FROM `tb_keuangan_internal`
WHERE DATE(tgl) = '2025-07-31'
---
    private function getDashboardStats()
    {
        $db = \Config\Database::connect();

        // Basic counts
        $total_mahasiswa = $db->table('tb_mahasiswa')->where('status', 'Aktif')->countAllResults();
        $total_dosen = $db->table('tb_dosen')->where('status', 'Aktif')->countAllResults();
        $total_prodi = $db->table('tb_prodi')->countAllResults();
        $total_matkul = $db->table('tb_mata_kuliah')->countAllResults();

        // Periode aktif
        $periode_aktif = $db->table('tb_periode_akademik')
            ->where('is_active', 1)
            ->get()->getRowArray();

        // KRS statistics
        $krs_pending = $db->table('tb_krs')
            ->where('status', 'Menunggu Persetujuan')
            ->countAllResults();
        $krs_disetujui = $db->table('tb_krs')
            ->where('status', 'Disetujui')
            ->countAllResults();
        $krs_ditolak = $db->table('tb_krs')
            ->where('status', 'Ditolak')
            ->countAllResults();

        // Academic data
        $total_kelas = $db->table('tb_kelas')
            ->where('periode_id', $periode_aktif['id_periode'] ?? 1)
            ->countAllResults();
        $total_beasiswa = $db->table('tb_beasiswa')
            ->where('status', 'Aktif')
            ->countAllResults();
        $total_inventaris = $db->table('tb_inventaris')
            ->where('status', 'Baik')
            ->countAllResults();
        $total_pengaduan = $db->table('tb_pengaduan')
            ->where('status', 'Pending')
            ->countAllResults();
        $total_artikel = $db->table('tb_artikel')
            ->where('status', 'Published')
            ->countAllResults();
        $total_kegiatan = $db->table('tb_kegiatan')
            ->where('status', 'Aktif')
            ->countAllResults();

        // Financial quick stats
        $currentMonth = date('Y-m');
        $pemasukan_hari_ini = $db->table('tb_keuangan_internal')
            ->selectSum('dana_masuk')
            ->where('DATE(tgl)', date('Y-m-d'))
            ->get()->getRowArray()['dana_masuk'] ?? 0;
        $pengeluaran_hari_ini = $db->table('tb_keuangan_internal')
            ->selectSum('dana_keluar')
            ->where('DATE(tgl)', date('Y-m-d'))
            ->get()->getRowArray()['dana_keluar'] ?? 0;

SELECT `tb_krs`.`tgl_pengajuan`, `tb_mahasiswa`.`nama`, `tb_krs`.`status`
FROM `tb_krs`
JOIN `tb_mahasiswa` ON `tb_mahasiswa`.`id_mahasiswa` = `tb_krs`.`mahasiswa_id`
ORDER BY `tb_krs`.`tgl_pengajuan` DESC
 LIMIT 5
SELECT `tgl`, `keterangan`, `dana_masuk`, `dana_keluar`
FROM `tb_keuangan_internal`
ORDER BY `tgl` DESC
 LIMIT 3
---
    private function getRecentActivities()
    {
        $db = \Config\Database::connect();

        $activities = [];

        // Recent KRS submissions
        $recent_krs = $db->table('tb_krs')
            ->join('tb_mahasiswa', 'tb_mahasiswa.id_mahasiswa = tb_krs.mahasiswa_id')
            ->select('tb_krs.tgl_pengajuan, tb_mahasiswa.nama, tb_krs.status')
            ->orderBy('tb_krs.tgl_pengajuan', 'DESC')
            ->limit(5)
            ->get()->getResultArray();

        foreach ($recent_krs as $krs) {
            $activities[] = [
                'type' => 'KRS',
                'message' => $krs['nama'] . ' mengajukan KRS',
                'time' => $krs['tgl_pengajuan'],
                'status' => $krs['status'],
                'icon' => 'fas fa-file-alt',
                'color' => $krs['status'] == 'Disetujui' ? 'success' : 'warning'
            ];
        }

        // Recent financial transactions
        $recent_finance = $db->table('tb_keuangan_internal')
            ->select('tgl, keterangan, dana_masuk, dana_keluar')
            ->orderBy('tgl', 'DESC')
            ->limit(3)
            ->get()->getResultArray();

SELECT SUM(`dana_masuk`) AS `dana_masuk`
FROM `tb_keuangan_internal`
WHERE DATE_FORMAT(tgl, "%Y-%m") = '2025-07'
SELECT SUM(`dana_keluar`) AS `dana_keluar`
FROM `tb_keuangan_internal`
WHERE DATE_FORMAT(tgl, "%Y-%m") = '2025-07'
SELECT SUM(`saldo_akhir`) AS `saldo_akhir`
FROM `tb_rekening_bank`
WHERE `is_active` = 1
---
    private function getFinancialSummary()
    {
        $db = \Config\Database::connect();
        $currentMonth = date('Y-m');

        $pemasukan = $db->table('tb_keuangan_internal')
            ->selectSum('dana_masuk')
            ->where('DATE_FORMAT(tgl, "%Y-%m")', $currentMonth)
            ->get()->getRowArray()['dana_masuk'] ?? 0;

        $pengeluaran = $db->table('tb_keuangan_internal')
            ->selectSum('dana_keluar')
            ->where('DATE_FORMAT(tgl, "%Y-%m")', $currentMonth)
            ->get()->getRowArray()['dana_keluar'] ?? 0;

        $saldo_bank = $db->table('tb_rekening_bank')
            ->selectSum('saldo_akhir')
            ->where('is_active', 1)
            ->get()->getRowArray()['saldo_akhir'] ?? 0;

SELECT `tb_prodi`.`nama_prodi`, COUNT(tb_mahasiswa.id_mahasiswa) as jumlah
FROM `tb_mahasiswa`
JOIN `tb_prodi` ON `tb_prodi`.`id_prodi` = `tb_mahasiswa`.`prodi_id`
GROUP BY `tb_prodi`.`id_prodi`
SELECT `tb_prodi`.`nama_prodi`, COUNT(tb_dosen.id_dosen) as jumlah
FROM `tb_dosen`
JOIN `tb_prodi` ON `tb_prodi`.`id_prodi` = `tb_dosen`.`prodi_id`
GROUP BY `tb_prodi`.`id_prodi`
SELECT `status`, COUNT(*) as jumlah
FROM `tb_krs`
GROUP BY `status`
---
    private function getAcademicOverview()
    {
        $db = \Config\Database::connect();

        // Mahasiswa per prodi
        $mahasiswa_per_prodi = $db->table('tb_mahasiswa')
            ->join('tb_prodi', 'tb_prodi.id_prodi = tb_mahasiswa.prodi_id')
            ->select('tb_prodi.nama_prodi, COUNT(tb_mahasiswa.id_mahasiswa) as jumlah')
            ->groupBy('tb_prodi.id_prodi')
            ->get()->getResultArray();

        // Dosen per prodi
        $dosen_per_prodi = $db->table('tb_dosen')
            ->join('tb_prodi', 'tb_prodi.id_prodi = tb_dosen.prodi_id')
            ->select('tb_prodi.nama_prodi, COUNT(tb_dosen.id_dosen) as jumlah')
            ->groupBy('tb_prodi.id_prodi')
            ->get()->getResultArray();

        // KRS statistics
        $krs_stats = $db->table('tb_krs')
            ->select('status, COUNT(*) as jumlah')
            ->groupBy('status')
            ->get()->getResultArray();