app/Controllers/Dashboard.php

SELECT `tb_krs`.*, `tb_mata_kuliah`.`kode_matkul`, `tb_mata_kuliah`.`nama_matkul`, `tb_mata_kuliah`.`sks`
FROM `tb_krs`
JOIN `tb_mata_kuliah` ON `tb_mata_kuliah`.`id_matkul` = `tb_krs`.`mata_kuliah_id`
WHERE `tb_krs`.`mahasiswa_id` = '7'
AND `tb_krs`.`status` != 'Ditolak'
---
    public function KRS()
    {
        $mahasiswa = $this->ModelMahasiswa->getBiodataWithAkademik(session()->get('user_id'));
        $matkul_tersedia = $this->ModelMataKuliah->getMatkulForKRS($mahasiswa['prodi_id'], $mahasiswa['semester_aktif']);

        // Get existing KRS
        $db = \Config\Database::connect();
        $krs_existing = $db->table('tb_krs')
            ->join('tb_mata_kuliah', 'tb_mata_kuliah.id_matkul = tb_krs.mata_kuliah_id')
            ->select('tb_krs.*, tb_mata_kuliah.kode_matkul, tb_mata_kuliah.nama_matkul, tb_mata_kuliah.sks')
            ->where('tb_krs.mahasiswa_id', session()->get('user_id'))
            ->where('tb_krs.status !=', 'Ditolak')
            ->get()->getResultArray();