app/Controllers/KasInternal.php

    private function getAnggaranData()
    {
        $db = \Config\Database::connect();
        return $db->table('tb_anggaran')
            ->join('tb_kategori_keuangan', 'tb_kategori_keuangan.id_kategori = tb_anggaran.kategori_id', 'left')
            ->join('tb_periode_akademik', 'tb_periode_akademik.id_periode = tb_anggaran.periode_id', 'left')
            ->select('tb_anggaran.*, tb_kategori_keuangan.nama_kategori, tb_periode_akademik.semester, tb_periode_akademik.tahun_akademik')
            ->orderBy('tb_anggaran.created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `tb_anggaran`.*, `tb_kategori_keuangan`.`nama_kategori`, `tb_periode_akademik`.`semester`, `tb_periode_akademik`.`tahun_akademik`
FROM `tb_anggaran`
LEFT JOIN `tb_kategori_keuangan` ON `tb_kategori_keuangan`.`id_kategori` = `tb_anggaran`.`kategori_id`
LEFT JOIN `tb_periode_akademik` ON `tb_periode_akademik`.`id_periode` = `tb_anggaran`.`periode_id`
ORDER BY `tb_anggaran`.`created_at` DESC

    private function getPeriodeOptions()
    {
        $db = \Config\Database::connect();
        return $db->table('tb_periode_akademik')
            ->where('is_active', 1)
            ->orderBy('tahun_akademik', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_periode_akademik`
WHERE `is_active` = 1
ORDER BY `tahun_akademik` DESC

    private function getKategoriOptions()
    {
        $db = \Config\Database::connect();
        return $db->table('tb_kategori_keuangan')
            ->where('is_active', 1)
            ->orderBy('nama_kategori')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_kategori_keuangan`
WHERE `is_active` = 1
ORDER BY `nama_kategori`

    private function getRekeningData()
    {
        $db = \Config\Database::connect();
        return $db->table('tb_rekening_bank')
            ->where('is_active', 1)
            ->orderBy('nama_bank')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_rekening_bank`
WHERE `is_active` = 1
ORDER BY `nama_bank`

    private function getKategoriData()
    {
        $db = \Config\Database::connect();
        return $db->table('tb_kategori_keuangan')
            ->where('is_active', 1)
            ->orderBy('jenis')
            ->orderBy('nama_kategori')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_kategori_keuangan`
WHERE `is_active` = 1
ORDER BY `jenis`, `nama_kategori`

    private function getLaporanSummary($periode)
    {
        $db = \Config\Database::connect();
        $year = substr($periode, 0, 4);
        $month = substr($periode, 5, 2);

        $result = $db->table('tb_keuangan_internal')
            ->select('SUM(dana_masuk) as total_masuk, SUM(dana_keluar) as total_keluar')
            ->where('YEAR(tgl)', $year)
            ->where('MONTH(tgl)', $month)
            ->get()->getRowArray();
---
SELECT SUM(dana_masuk) as total_masuk, SUM(dana_keluar) as total_keluar
FROM `tb_keuangan_internal`
WHERE YEAR(tgl) = '2025'
AND MONTH(tgl) = '08'

    private function getLaporanPemasukan($periode)
    {
        $db = \Config\Database::connect();
        $year = substr($periode, 0, 4);
        $month = substr($periode, 5, 2);

        return $db->table('tb_keuangan_internal k')
            ->join('tb_kategori_keuangan kat', 'kat.id_kategori = k.kategori_id', 'left')
            ->select('COALESCE(kat.nama_kategori, "Tidak ada kategori") as kategori, SUM(k.dana_masuk) as total')
            ->where('YEAR(k.tgl)', $year)
            ->where('MONTH(k.tgl)', $month)
            ->where('k.dana_masuk >', 0)
            ->groupBy('k.kategori_id')
            ->orderBy('total', 'DESC')
            ->get()->getResultArray();
---
SELECT COALESCE(kat.nama_kategori, "Tidak ada kategori") as kategori, SUM(k.dana_masuk) as total
FROM `tb_keuangan_internal` `k`
LEFT JOIN `tb_kategori_keuangan` `kat` ON `kat`.`id_kategori` = `k`.`kategori_id`
WHERE YEAR(k.tgl) = '2025'
AND MONTH(k.tgl) = '08'
AND `k`.`dana_masuk` > 0
GROUP BY `k`.`kategori_id`
ORDER BY `total` DESC

    private function getLaporanPengeluaran($periode)
    {
        $db = \Config\Database::connect();
        $year = substr($periode, 0, 4);
        $month = substr($periode, 5, 2);

        return $db->table('tb_keuangan_internal k')
            ->join('tb_kategori_keuangan kat', 'kat.id_kategori = k.kategori_id', 'left')
            ->select('COALESCE(kat.nama_kategori, "Tidak ada kategori") as kategori, SUM(k.dana_keluar) as total')
            ->where('YEAR(k.tgl)', $year)
            ->where('MONTH(k.tgl)', $month)
            ->where('k.dana_keluar >', 0)
            ->groupBy('k.kategori_id')
            ->orderBy('total', 'DESC')
            ->get()->getResultArray();
---
SELECT COALESCE(kat.nama_kategori, "Tidak ada kategori") as kategori, SUM(k.dana_keluar) as total
FROM `tb_keuangan_internal` `k`
LEFT JOIN `tb_kategori_keuangan` `kat` ON `kat`.`id_kategori` = `k`.`kategori_id`
WHERE YEAR(k.tgl) = '2025'
AND MONTH(k.tgl) = '08'
AND `k`.`dana_keluar` > 0
GROUP BY `k`.`kategori_id`
ORDER BY `total` DESC

    private function getLaporanTransaksi($periode)
    {
        $db = \Config\Database::connect();
        $year = substr($periode, 0, 4);
        $month = substr($periode, 5, 2);

        return $db->table('tb_keuangan_internal k')
            ->join('tb_kategori_keuangan kat', 'kat.id_kategori = k.kategori_id', 'left')
            ->select('k.*, COALESCE(kat.nama_kategori, "Tidak ada kategori") as kategori')
            ->where('YEAR(k.tgl)', $year)
            ->where('MONTH(k.tgl)', $month)
            ->orderBy('k.tgl', 'ASC')
            ->get()->getResultArray();
---
SELECT `k`.*, COALESCE(kat.nama_kategori, "Tidak ada kategori") as kategori
FROM `tb_keuangan_internal` `k`
LEFT JOIN `tb_kategori_keuangan` `kat` ON `kat`.`id_kategori` = `k`.`kategori_id`
WHERE YEAR(k.tgl) = '2025'
AND MONTH(k.tgl) = '08'
ORDER BY `k`.`tgl` ASC

    private function getTotalSaldoBank()
    {
        $db = \Config\Database::connect();
        $result = $db->table('tb_rekening_bank')
            ->select('SUM(saldo_akhir) as total_saldo')
            ->where('is_active', 1)
            ->get()->getRowArray();
---
SELECT SUM(saldo_akhir) as total_saldo
FROM `tb_rekening_bank`
WHERE `is_active` = 1

    private function getAvailablePeriods()
    {
        $db = \Config\Database::connect();
        return $db->table('tb_keuangan_internal')
            ->select('MAX(YEAR(tgl)) as year, MAX(MONTH(tgl)) as month, CONCAT(MAX(YEAR(tgl)), "-", LPAD(MAX(MONTH(tgl)), 2, "0")) as periode, DATE_FORMAT(MIN(tgl), "%M %Y") as periode_name')
            ->groupBy('YEAR(tgl), MONTH(tgl)')
            ->orderBy('MAX(YEAR(tgl))', 'DESC')
            ->orderBy('MAX(MONTH(tgl))', 'DESC')
            ->get()->getResultArray();
---
SELECT MAX(YEAR(tgl)) as year, MAX(MONTH(tgl)) as month, CONCAT(MAX(YEAR(tgl)), "-", LPAD(MAX(MONTH(tgl)), 2, "0")) as periode, DATE_FORMAT(MIN(tgl), "%M %Y") as periode_name
FROM `tb_keuangan_internal`
GROUP BY YEAR(tgl), MONTH(tgl)
ORDER BY MAX(YEAR(tgl)) DESC, MAX(MONTH(tgl)) DESC