app/Controllers/MataKuliah.php

    public function index()
    {
        try {
            $mata_kuliah = $this->ModelMataKuliah->getAllWithDosen();
            $prodi = $this->ModelProdi->findAll();
---
SELECT *
FROM `tb_prodi`

    public function edit($id)
    {
        try {
            $mata_kuliah = $this->ModelMataKuliah->find($id);
            if (!$mata_kuliah) {
                return redirect()->to('/admin/mata-kuliah')->with('error', 'Data tidak ditemukan');
            }

            $data = [
                'judul' => 'Edit Mata Kuliah',
                'menu' => 'mata_kuliah',
                'submenu' => '',
                'page' => 'admin/mata_kuliah/edit',
                'mata_kuliah' => $mata_kuliah,
                'prodi' => $this->ModelProdi->findAll(),
                'dosen' => $this->ModelDosen->findAll()
---
SELECT *
FROM `tb_prodi`
SELECT *
FROM `tb_dosen`