app/Controllers/Prodi.php

SELECT *
FROM `tb_prodi`
---
    public function index()
    {
        $data = [
            'judul' => 'Data Program Studi',
            'menu' => 'prodi',
            'submenu' => '',
            'page' => 'admin/prodi/index',
            'prodi' => $this->ModelProdi->findAll(),

SELECT *
FROM `tb_prodi`
WHERE `tb_prodi`.`id_prodi` = '1'
---
    public function edit($id_prodi)
    {
        $data = [
            'judul' => 'Edit Program Studi',
            'menu' => 'prodi',
            'submenu' => '',
            'page' => 'admin/prodi/edit',
            'prodi' => $this->ModelProdi->find($id_prodi),
        ];