app/Models/ModelUser.php

SELECT *
FROM `tb_level_user`
---
    public function AllDataLevelUser()
    {
        return $this->db->table('tb_level_user')
            ->get()->getResultArray();