app/Models/ModelLaporan.php

SELECT DISTINCT YEAR(tgl) AS tahun
FROM `tb_keuangan_internal`
ORDER BY `tahun` DESC
---
    public function getTahunKeuangan()
    {
        return $this->db->table('tb_keuangan_internal')
            ->select('YEAR(tgl) AS tahun')
            ->distinct()->orderBy('tahun', 'DESC')
            ->get()->getResult();

SELECT `nama_kategori` as `keterangan`
FROM `tb_kategori_keuangan`
WHERE `is_active` = 1
ORDER BY `nama_kategori` ASC
---
    public function getKategoriKeuangan()
    {
        return $this->db->table('tb_kategori_keuangan')
            ->select('nama_kategori as keterangan')
            ->where('is_active', 1)
            ->orderBy('nama_kategori', 'ASC')
            ->get()->getResult();

SELECT DISTINCT YEAR(created_at) AS tahun
FROM `tb_inventaris`
ORDER BY `tahun` DESC
---
    public function getTahunInventaris()
    {
        return $this->db->table('tb_inventaris')
            ->select('YEAR(created_at) AS tahun')
            ->distinct()->orderBy('tahun', 'DESC')
            ->get()->getResult();