app/Models/ModelKRS.php

SELECT `tb_krs`.*, `tb_mahasiswa`.`nama` as `nama_mahasiswa`, `tb_mahasiswa`.`nim`, `tb_mahasiswa`.`semester_aktif`, `tb_mata_kuliah`.`kode_matkul`, `tb_mata_kuliah`.`nama_matkul`, `tb_mata_kuliah`.`sks`, `tb_periode_akademik`.`tahun_akademik`
FROM `tb_krs`
JOIN `tb_mahasiswa` ON `tb_mahasiswa`.`id_mahasiswa` = `tb_krs`.`mahasiswa_id`
JOIN `tb_mata_kuliah` ON `tb_mata_kuliah`.`id_matkul` = `tb_krs`.`mata_kuliah_id`
LEFT JOIN `tb_periode_akademik` ON `tb_periode_akademik`.`id_periode` = `tb_krs`.`periode_id`
ORDER BY `tb_krs`.`created_at` DESC
---
    public function AllData()
    {
        return $this->db->table('tb_krs')
            ->join('tb_mahasiswa', 'tb_mahasiswa.id_mahasiswa = tb_krs.mahasiswa_id')
            ->join('tb_mata_kuliah', 'tb_mata_kuliah.id_matkul = tb_krs.mata_kuliah_id')
            ->join('tb_periode_akademik', 'tb_periode_akademik.id_periode = tb_krs.periode_id', 'left')
            ->select('tb_krs.*, tb_mahasiswa.nama as nama_mahasiswa, tb_mahasiswa.nim, tb_mahasiswa.semester_aktif, tb_mata_kuliah.kode_matkul, tb_mata_kuliah.nama_matkul, tb_mata_kuliah.sks, tb_periode_akademik.tahun_akademik')
            ->orderBy('tb_krs.created_at', 'DESC')
            ->get()->getResultArray();

DELETE FROM `tb_krs`
WHERE `id_krs` = '30'
---
    public function DeleteData($id_krs)
    {
        return $this->db->table('tb_krs')
            ->where('id_krs', $id_krs)
            ->delete();