app/Models/ModelKHS.php

    public function AllData()
    {
        return $this->db->table('tb_khs')
            ->join('tb_mahasiswa', 'tb_mahasiswa.id_mahasiswa = tb_khs.mahasiswa_id')
            ->join('tb_mata_kuliah', 'tb_mata_kuliah.id_matkul = tb_khs.matkul_id')
            ->select('tb_khs.*, tb_mahasiswa.nama as nama_mahasiswa, tb_mahasiswa.nim, tb_mata_kuliah.kode_matkul, tb_mata_kuliah.nama_matkul, tb_mata_kuliah.sks')
            ->orderBy('tb_khs.created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `tb_khs`.*, `tb_mahasiswa`.`nama` as `nama_mahasiswa`, `tb_mahasiswa`.`nim`, `tb_mata_kuliah`.`kode_matkul`, `tb_mata_kuliah`.`nama_matkul`, `tb_mata_kuliah`.`sks`
FROM `tb_khs`
JOIN `tb_mahasiswa` ON `tb_mahasiswa`.`id_mahasiswa` = `tb_khs`.`mahasiswa_id`
JOIN `tb_mata_kuliah` ON `tb_mata_kuliah`.`id_matkul` = `tb_khs`.`matkul_id`
ORDER BY `tb_khs`.`created_at` DESC