app/Models/ModelAdmin.php

SELECT *
FROM `tb_setting`
WHERE `id_set` = 1
---
    public function ViewSetting()
    {
        return $this->db->table('tb_setting')
            ->where('id_set', 1)
            ->get()->getRowArray();

SELECT `tb_keuangan_internal`.*, `tb_kategori_keuangan`.`nama_kategori`, `tb_kategori_keuangan`.`kode_kategori`
FROM `tb_keuangan_internal`
LEFT JOIN `tb_kategori_keuangan` ON `tb_kategori_keuangan`.`id_kategori` = `tb_keuangan_internal`.`kategori_id`
WHERE month(tgl) = '07'
AND year(tgl) = '2025'
ORDER BY `tgl` DESC
---
    public function AllDataKasInternal()
    {
        return $this->db->table('tb_keuangan_internal')
            ->join('tb_kategori_keuangan', 'tb_kategori_keuangan.id_kategori = tb_keuangan_internal.kategori_id', 'left')
            ->select('tb_keuangan_internal.*, tb_kategori_keuangan.nama_kategori, tb_kategori_keuangan.kode_kategori')
            ->where('month(tgl)', date('m'))
            ->where('year(tgl)', date('Y'))
            ->orderBy('tgl', 'DESC')
            ->get()->getResultArray();

SELECT *
FROM `tb_pengaduan`
WHERE `status` = '0'
---
    public function AllDataPengaduan()
    {
        return $this->db->table('tb_pengaduan')
            ->where('status', '0')
            ->get()->getResultArray();

SELECT `tb_users`.*, `tb_users`.`mahasiswa_id`, `tb_users`.`dosen_id`
FROM `tb_users`
WHERE `id_user` = '1'
---
    public function getUserById($user_id)
    {
        return $this->db->table('tb_users')
            ->select('tb_users.*, tb_users.mahasiswa_id, tb_users.dosen_id')
            ->where('id_user', $user_id)
            ->get()
            ->getRowArray();