app/Models/ModelNilai.php

SELECT `tb_nilai`.*, `tb_mahasiswa`.`nama`, `tb_mahasiswa`.`nim`, `tb_mata_kuliah`.`nama_matkul`, `tb_mata_kuliah`.`kode_matkul`, `tb_mata_kuliah`.`sks`, `tb_periode_akademik`.`semester`, `tb_periode_akademik`.`tahun_akademik`, `tb_prodi`.`nama_prodi`
FROM `tb_nilai`
JOIN `tb_mahasiswa` ON `tb_mahasiswa`.`id_mahasiswa` = `tb_nilai`.`mahasiswa_id`
JOIN `tb_mata_kuliah` ON `tb_mata_kuliah`.`id_matkul` = `tb_nilai`.`matkul_id`
JOIN `tb_periode_akademik` ON `tb_periode_akademik`.`id_periode` = `tb_nilai`.`periode_id`
JOIN `tb_prodi` ON `tb_prodi`.`id_prodi` = `tb_mahasiswa`.`prodi_id`
ORDER BY `tb_periode_akademik`.`tahun_akademik` DESC, `tb_mahasiswa`.`nim` ASC
---
    public function getAllNilaiWithDetails()
    {
        return $this->db->table('tb_nilai')
            ->join('tb_mahasiswa', 'tb_mahasiswa.id_mahasiswa = tb_nilai.mahasiswa_id')
            ->join('tb_mata_kuliah', 'tb_mata_kuliah.id_matkul = tb_nilai.matkul_id')
            ->join('tb_periode_akademik', 'tb_periode_akademik.id_periode = tb_nilai.periode_id')
            ->join('tb_prodi', 'tb_prodi.id_prodi = tb_mahasiswa.prodi_id')
            ->select('tb_nilai.*, tb_mahasiswa.nama, tb_mahasiswa.nim, tb_mata_kuliah.nama_matkul, tb_mata_kuliah.kode_matkul, tb_mata_kuliah.sks, tb_periode_akademik.semester, tb_periode_akademik.tahun_akademik, tb_prodi.nama_prodi')
            ->orderBy('tb_periode_akademik.tahun_akademik', 'DESC')
            ->orderBy('tb_mahasiswa.nim', 'ASC')
            ->get()->getResultArray();

SELECT `tb_nilai`.*, `tb_mata_kuliah`.`kode_matkul`, `tb_mata_kuliah`.`nama_matkul`, `tb_mata_kuliah`.`sks`
FROM `tb_nilai`
JOIN `tb_mata_kuliah` ON `tb_mata_kuliah`.`id_matkul` = `tb_nilai`.`matkul_id`
WHERE `tb_nilai`.`mahasiswa_id` = '13'
ORDER BY `tb_mata_kuliah`.`semester` ASC
---
    public function getNilaiByMahasiswa($mahasiswa_id)
    {
        return $this->db->table('tb_nilai')
            ->join('tb_mata_kuliah', 'tb_mata_kuliah.id_matkul = tb_nilai.matkul_id')
            ->join('tb_periode_akademik', 'tb_periode_akademik.id_periode = tb_nilai.periode_id')
            ->select('tb_nilai.*, tb_mata_kuliah.nama_matkul, tb_mata_kuliah.kode_matkul, tb_mata_kuliah.sks, tb_periode_akademik.semester, tb_periode_akademik.tahun_akademik')
            ->where('tb_nilai.mahasiswa_id', $mahasiswa_id)
            ->orderBy('tb_periode_akademik.tahun_akademik', 'DESC')
            ->orderBy('tb_mata_kuliah.kode_matkul', 'ASC')
            ->get()->getResultArray();