app/Models/ModelKasInternal.php

    public function AllDataDanaMasuk()
    {
        return $this->db->table('tb_keuangan_internal k')
            ->join('tb_kategori_keuangan kat', 'kat.id_kategori = k.kategori_id', 'left')
            ->select('k.*, k.id_kas_internal as id_keuangan, COALESCE(kat.nama_kategori, "Tidak ada kategori") as kategori')
            ->where('k.status', 'Masuk')
            ->orderBy('k.created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `k`.*, `k`.`id_kas_internal` as `id_keuangan`, COALESCE(kat.nama_kategori, "Tidak ada kategori") as kategori
FROM `tb_keuangan_internal` `k`
LEFT JOIN `tb_kategori_keuangan` `kat` ON `kat`.`id_kategori` = `k`.`kategori_id`
WHERE `k`.`status` = 'Masuk'
ORDER BY `k`.`created_at` DESC

    public function countByKategori($kategori)
    {
        return $this->db->table('tb_keuangan_internal k')
            ->join('tb_kategori_keuangan kat', 'kat.id_kategori = k.kategori_id', 'left')
            ->where('COALESCE(kat.nama_kategori, "Tidak ada kategori")', $kategori)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_keuangan_internal` `k`
LEFT JOIN `tb_kategori_keuangan` `kat` ON `kat`.`id_kategori` = `k`.`kategori_id`
WHERE COALESCE(kat.nama_kategori, "Tidak ada kategori") = 'Uang Kuliah'