app/Models/ModelMataKuliah.php

    public function getAllWithDosen()
    {
        return $this->select('tb_mata_kuliah.id_matkul, tb_mata_kuliah.kode_matkul, tb_mata_kuliah.nama_matkul, tb_mata_kuliah.sks, tb_mata_kuliah.semester, tb_prodi.nama_prodi, tb_dosen.nama as nama_dosen')
                    ->join('tb_prodi', 'tb_prodi.id_prodi = tb_mata_kuliah.prodi_id', 'left')
                    ->join('tb_dosen', 'tb_dosen.id_dosen = tb_mata_kuliah.dosen_id', 'left')
                    ->orderBy('tb_mata_kuliah.prodi_id', 'ASC')
                    ->orderBy('tb_mata_kuliah.semester', 'ASC')
                    ->limit(100)
                    ->findAll();
---
SELECT `tb_mata_kuliah`.`id_matkul`, `tb_mata_kuliah`.`kode_matkul`, `tb_mata_kuliah`.`nama_matkul`, `tb_mata_kuliah`.`sks`, `tb_mata_kuliah`.`semester`, `tb_prodi`.`nama_prodi`, `tb_dosen`.`nama` as `nama_dosen`
FROM `tb_mata_kuliah`
LEFT JOIN `tb_prodi` ON `tb_prodi`.`id_prodi` = `tb_mata_kuliah`.`prodi_id`
LEFT JOIN `tb_dosen` ON `tb_dosen`.`id_dosen` = `tb_mata_kuliah`.`dosen_id`
ORDER BY `tb_mata_kuliah`.`prodi_id` ASC, `tb_mata_kuliah`.`semester` ASC
 LIMIT 100

    public function getMatkulForKRS($prodi_id, $semester)
    {
        return $this->select('tb_mata_kuliah.*, tb_dosen.nama as nama_dosen')
                    ->join('tb_dosen', 'tb_dosen.id_dosen = tb_mata_kuliah.dosen_id', 'left')
                    ->where('tb_mata_kuliah.prodi_id', $prodi_id)
                    ->where('tb_mata_kuliah.semester', $semester)
                    ->findAll();
---
SELECT `tb_mata_kuliah`.*, `tb_dosen`.`nama` as `nama_dosen`
FROM `tb_mata_kuliah`
LEFT JOIN `tb_dosen` ON `tb_dosen`.`id_dosen` = `tb_mata_kuliah`.`dosen_id`
WHERE `tb_mata_kuliah`.`prodi_id` = '3'
AND `tb_mata_kuliah`.`semester` = '6'