app/Models/ModelArtikel.php

SELECT `tb_artikel`.*, `tb_kategori_artikel`.`nama` as `nama_kategori`
FROM `tb_artikel`
LEFT JOIN `tb_kategori_artikel` ON `tb_kategori_artikel`.`id_kat_artikel` = `tb_artikel`.`kat_artikel_id`
ORDER BY `created_at` DESC
---
    public function AllDataArtikel()
    {
        return $this->db->table('tb_artikel')
            ->join('tb_kategori_artikel', 'tb_kategori_artikel.id_kat_artikel = tb_artikel.kat_artikel_id', 'left')
            ->select('tb_artikel.*, tb_kategori_artikel.nama as nama_kategori')
            ->orderBy('created_at DESC')
            ->get()->getResultArray();