app/Models/ModelBeasiswa.php

    public function AllData()
    {
        return $this->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `tb_beasiswa`
ORDER BY `created_at` DESC