app/Models/ModelKegiatan.php

SELECT *
FROM `tb_kegiatan`
ORDER BY `created_at` DESC
---
    public function AllData()
    {
        return $this->db->table('tb_kegiatan')
            ->orderBy('created_at DESC')
            ->get()->getResultArray();

INSERT INTO `tb_kegiatan` (`judul`, `kategori`, `tgl`, `waktu`, `tempat`, `status`, `keterangan`, `user_id`, `created_at`, `updated_at`) VALUES ('kkk', 'kegiatan', '2025-08-15', '09:09', 'll', 'Public', 'kk', '1', '2025-08-01 20:14:51', '2025-08-01 20:14:51')
---
    public function InsertData($data)
    {
        $data['created_at'] = date('Y-m-d H:i:s');
        $data['updated_at'] = date('Y-m-d H:i:s');
        $this->db->table('tb_kegiatan')->insert($data);