app/Models/ModelKasInternal.php

SELECT *
FROM `tb_keuangan_internal`
ORDER BY `created_at` DESC
---
    public function AllData()
    {
        return $this->db->table('tb_keuangan_internal')
            ->orderBy('created_at DESC')
            ->get()->getResultArray();