app/Models/ModelPeriodeAkademik.php

SELECT *
FROM `tb_periode_akademik`
ORDER BY `tahun_akademik` DESC, `semester` DESC
---
    public function AllData()
    {
        return $this->db->table('tb_periode_akademik')
            ->orderBy('tahun_akademik', 'DESC')
            ->orderBy('semester', 'DESC')
            ->get()->getResultArray();

SELECT *
FROM `tb_periode_akademik`
WHERE `is_active` = 1
---
    public function getPeriodeAktif()
    {
        return $this->db->table('tb_periode_akademik')
            ->where('is_active', 1)
            ->get()->getRowArray();