app/Models/ModelInventaris.php

    public function AllDataMasuk()
    {
        return $this->db->table('tb_inventaris')
            ->where('status', 0)
            ->where('jumlah >', 0)
            ->orderBy('created_at DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_inventaris`
WHERE `status` = 0
AND `jumlah` > 0
ORDER BY `created_at` DESC

    public function AllDatakeluar()
    {
        return $this->db->table('tb_inventaris')
            ->where('status', 1)
            ->orderBy('created_at DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_inventaris`
WHERE `status` = 1
ORDER BY `created_at` DESC

    public function getNamaBarangMasuk()
    {
        return $this->db->table('tb_inventaris')
            ->select('nama_barang')
            ->where('status', 0)
            ->where('jumlah >', 0)
            ->groupBy('nama_barang')
            ->get()->getResultArray();
---
SELECT `nama_barang`
FROM `tb_inventaris`
WHERE `status` = 0
AND `jumlah` > 0
GROUP BY `nama_barang`