app/Models/ModelDosen.php

    public function AllData()
    {
        return $this->db->table('tb_dosen')
            ->join('tb_prodi', 'tb_prodi.id_prodi = tb_dosen.prodi_id', 'left')
            ->select('tb_dosen.*, tb_prodi.nama_prodi')
            ->orderBy('tb_prodi.nama_prodi', 'ASC')
            ->orderBy('tb_dosen.nama', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_dosen`.*, `tb_prodi`.`nama_prodi`
FROM `tb_dosen`
LEFT JOIN `tb_prodi` ON `tb_prodi`.`id_prodi` = `tb_dosen`.`prodi_id`
ORDER BY `tb_prodi`.`nama_prodi` ASC, `tb_dosen`.`nama` ASC