app/Models/ModelMahasiswa.php

    public function AllData()
    {
        return $this->db->table('tb_mahasiswa')
            ->join('tb_prodi', 'tb_prodi.id_prodi = tb_mahasiswa.prodi_id', 'left')
            ->join('tb_dosen', 'tb_dosen.id_dosen = tb_mahasiswa.dosen_pa_id', 'left')
            ->select('tb_mahasiswa.*, tb_prodi.nama_prodi, tb_dosen.nama as nama_dosen_pa')
            ->orderBy('tb_prodi.nama_prodi', 'ASC')
            ->orderBy('tb_mahasiswa.nim', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_mahasiswa`.*, `tb_prodi`.`nama_prodi`, `tb_dosen`.`nama` as `nama_dosen_pa`
FROM `tb_mahasiswa`
LEFT JOIN `tb_prodi` ON `tb_prodi`.`id_prodi` = `tb_mahasiswa`.`prodi_id`
LEFT JOIN `tb_dosen` ON `tb_dosen`.`id_dosen` = `tb_mahasiswa`.`dosen_pa_id`
ORDER BY `tb_prodi`.`nama_prodi` ASC, `tb_mahasiswa`.`nim` ASC

    public function getBiodataWithAkademik($user_id)
    {
        return $this->db->table('tb_mahasiswa')
            ->join('tb_prodi', 'tb_prodi.id_prodi = tb_mahasiswa.prodi_id', 'left')
            ->join('tb_dosen', 'tb_dosen.id_dosen = tb_mahasiswa.dosen_pa_id', 'left')
            ->select('tb_mahasiswa.*, tb_prodi.nama_prodi, tb_dosen.nama as nama_dosen_pa')
            ->where('tb_mahasiswa.id_mahasiswa', $user_id)
            ->get()->getRowArray();
---
SELECT `tb_mahasiswa`.*, `tb_prodi`.`nama_prodi`, `tb_dosen`.`nama` as `nama_dosen_pa`
FROM `tb_mahasiswa`
LEFT JOIN `tb_prodi` ON `tb_prodi`.`id_prodi` = `tb_mahasiswa`.`prodi_id`
LEFT JOIN `tb_dosen` ON `tb_dosen`.`id_dosen` = `tb_mahasiswa`.`dosen_pa_id`
WHERE `tb_mahasiswa`.`id_mahasiswa` = '13'