app/Views/v_template_admin.php

SELECT *
FROM `tb_setting`
---
<body>
    <?php
    $db = \Config\Database::connect();
    $web = $db->table('tb_setting')->get()->getRowArray();